Revit 2027 API
CompoundStructure.IsValidSegmentId Method
 Determines whether the specified integer is actually the id of a segment in this CompoundStructure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidSegmentId(
	int segmentId
)
Public Function IsValidSegmentId (
	segmentId As Integer
) As Boolean
public:
bool IsValidSegmentId(
	int segmentId
)
member IsValidSegmentId :
        segmentId : int -> bool
Parameters
segmentId Int32
 The id of a segment in this CompoundStructure.
Return Value
Boolean
 True if the specified segment is valid, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  This operation is valid only for vertically compound structures.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace